Autodesk.Revit.DB.ViewSchedule.GetTableData
Gets the writable table data object.
Returns:
The schedule data object.
Since:
2014

Autodesk.Revit.DB.ViewSchedule.IsValidTextTypeId(Autodesk.Revit.DB.ElementId)
Identifies if the input id represents a valid text type id for use in the schedule properties.
textTypeId:
The element id of the text type.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2014

Autodesk.Revit.DB.ViewSchedule.Export(System.String,System.String,Autodesk.Revit.DB.ViewScheduleExportOptions)
Exports the schedule data to a text file.
folder:
Path to the location where the file will be saved.
name:
Name of file.
options:
Options that relate to schedule export.
Throws Autodesk.Revit.Exceptions.ArgumentException:
NullOrEmpty
-or-
Contains invalid characters
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.FileAccessException:
The path indicated could not be accessed.
Throws Autodesk.Revit.Exceptions.InvalidPathArgumentException:
The folder does not exist.
Since:
2013

Autodesk.Revit.DB.ViewSchedule.HasImageField
Checks whether the schedule definition includes any image-related fields and if any elements in the schedule actually have images in those fields.
Remarks:
This method may return an incorrect value if the data of the schedule view is out of date. Check IsDataOutOfData(),
and call Autodesk.Revit.DB.ViewSchedule.RefreshData to ensure that the return value is correct.
Returns:
True if the schedule has at least one image field showing at least one image, false otherwise.
Since:
2015

Autodesk.Revit.DB.ViewSchedule.RestoreImageSize
Restores all images to their original sizes.
Remarks:
All images in the schedule will be restored to their original sizes when viewed as a ScheduleSheetInstance on a ViewSheet.
This reverts any changes made by setting Autodesk.Revit.DB.ViewSchedule.ImageRowHeight. Calling this method has no effect if HasImageField is false.
In the schedule view the column widths will be adjusted to match the image sizes, but only the name of the image will be shown.
For example, the users can attach different images to the kinds of rebar instances. These images may have different sizes.
When the users create the rebar schedule with this image field, by default the column width of this image field is equal to other fields,
which means it is not associated with the image original sizes during the schedule creation.
Since:
2015

Autodesk.Revit.DB.ViewSchedule.UngroupHeaders(System.Int32,System.Int32,System.Int32,System.Int32)
Ungroups selected headers of schedule.
top:
The index of the top row of the selected headers.
left:
The index of the left column of the selected headers.
bottom:
The index of the bottom row of the selected headers.
right:
The index of the right column of the selected headers.
Throws Autodesk.Revit.Exceptions.ArgumentException:
Headers could not be ungrouped.
Since:
2014

Autodesk.Revit.DB.ViewSchedule.CanUngroupHeaders(System.Int32,System.Int32,System.Int32,System.Int32)
Indicates if selected headers can be ungrouped.
top:
The index of the top row of the selected headers.
left:
The index of the left column of the selected headers.
bottom:
The index of the bottom row of the selected headers.
right:
The index of the right column of the selected headers.
Returns:
True if the selected headers can be grouped, false otherwise.
Since:
2014

Autodesk.Revit.DB.ViewSchedule.GroupHeaders(System.Int32,System.Int32,System.Int32,System.Int32,System.String)
Groups schedule header cells.
top:
The index of the top row of the selected headers.
left:
The index of the left column of the selected headers.
bottom:
The index of the bottom row of the selected headers.
right:
The index of the right column of the selected headers.
caption:
The header caption.
Throws Autodesk.Revit.Exceptions.ArgumentException:
Headers could not be grouped.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2014

Autodesk.Revit.DB.ViewSchedule.CanGroupHeaders(System.Int32,System.Int32,System.Int32,System.Int32)
Indicates if selected headers can be grouped for this schedule.
top:
The index of the top row of the selected headers.
left:
The index of the left column of the selected headers.
bottom:
The index of the bottom row of the selected headers.
right:
The index of the right column of the selected headers.
Returns:
True if the selected headers can be grouped, false otherwise.
Since:
2014

Autodesk.Revit.DB.ViewSchedule.RefreshData
Rebuilds the schedule data if it is out of date.
Returns:
True if the data is up to date after the refresh.
Since:
2014

Autodesk.Revit.DB.ViewSchedule.IsDataOutOfDate
Indicates whether the schedule data is out of date.
Remarks:
To improve performance, the ViewSchedule may contain TableSections that are only updated on demand.  For example,
the body section of a schedule is not updated when the ViewSchedule is closed.  In this case, you need to call
RefreshData to avoid getting the stale data.
Returns:
True if the schedule data is out of date, false otherwise.
Since:
2014

Autodesk.Revit.DB.ViewSchedule.GetDefaultNameForNoteBlock(Autodesk.Revit.DB.Document)
Gets the default view name that will be used when creating a note block.
document:
The document to which the new schedule will be added.
Returns:
The default view name.
Throws Autodesk.Revit.Exceptions.ArgumentException:
document is not a project document.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2013

Autodesk.Revit.DB.ViewSchedule.GetDefaultNameForRevisionSchedule(Autodesk.Revit.DB.Document)
Gets the default view name that will be used when creating a revision schedule.
document:
The titleblock family document to which the new schedule will be added.
Returns:
The default view name.
Throws Autodesk.Revit.Exceptions.ArgumentException:
document is not a titleblock family.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2013

Autodesk.Revit.DB.ViewSchedule.GetDefaultNameForKeynoteLegend(Autodesk.Revit.DB.Document)
Gets the default view name that will be used when creating a keynote legend.
document:
The document to which the new schedule will be added.
Returns:
The default view name.
Throws Autodesk.Revit.Exceptions.ArgumentException:
document is not a project document.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2013

Autodesk.Revit.DB.ViewSchedule.GetDefaultNameForSheetList(Autodesk.Revit.DB.Document)
Gets the default view name that will be used when creating a sheet list.
document:
The document to which the new schedule will be added.
Returns:
The default view name.
Throws Autodesk.Revit.Exceptions.ArgumentException:
document is not a project document.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2013

Autodesk.Revit.DB.ViewSchedule.GetDefaultNameForViewList(Autodesk.Revit.DB.Document)
Gets the default view name that will be used when creating a view list.
document:
The document to which the new schedule will be added.
Returns:
The default view name.
Throws Autodesk.Revit.Exceptions.ArgumentException:
document is not a project document.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2013

Autodesk.Revit.DB.ViewSchedule.GetDefaultNameForMaterialTakeoff(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.ElementId)
Gets the default view name that will be used when creating a material takeoff.
document:
The document to which the new schedule will be added.
categoryId:
The ID of the category whose elements will be included in the schedule, or InvalidElementId for a multi-category schedule.
Returns:
The default view name.
Throws Autodesk.Revit.Exceptions.ArgumentException:
document is not a project document.
-or-
categoryId is not a valid category for a material takeoff.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2013

Autodesk.Revit.DB.ViewSchedule.GetDefaultParameterNameForKeySchedule(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.ElementId)
Gets the default parameter name that will be used when creating a key schedule.
Remarks:
See ViewSchedule.KeyScheduleParameterName for details.
document:
The document to which the new schedule will be added.
categoryId:
The ID of the category of elements that the schedule's keys will be associated with.
Returns:
The default parameter name.
Throws Autodesk.Revit.Exceptions.ArgumentException:
document is not a project document.
-or-
categoryId is not a valid category for a key schedule.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2013

Autodesk.Revit.DB.ViewSchedule.GetDefaultNameForKeySchedule(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.ElementId)
Gets the default view name that will be used when creating a key schedule.
document:
The document to which the new schedule will be added.
categoryId:
The ID of the category of elements that the schedule's keys will be associated with.
Returns:
The default view name.
Throws Autodesk.Revit.Exceptions.ArgumentException:
document is not a project document.
-or-
categoryId is not a valid category for a key schedule.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2013

Autodesk.Revit.DB.ViewSchedule.GetDefaultNameForSchedule(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.ElementId,Autodesk.Revit.DB.ElementId)
Gets the default view name that will be used when creating a schedule.
document:
The document to which the new schedule will be added.
categoryId:
The ID of the category whose elements will be included in the schedule, or InvalidElementId for a multi-category schedule.
areaSchemeId:
The ID of an area scheme in an area schedule, InvalidElementId otherwise.
Returns:
The default view name.
Throws Autodesk.Revit.Exceptions.ArgumentException:
document is not a project document.
-or-
categoryId is not a valid category for a regular schedule.
-or-
In a non-area schedule, areaSchemeId is not InvalidElementId.
-or-
In an area schedule, areaSchemeId is not the ID of an area scheme.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2013

Autodesk.Revit.DB.ViewSchedule.GetDefaultNameForSchedule(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.ElementId)
Gets the default view name that will be used when creating a regular schedule.
document:
The document to which the new schedule will be added.
categoryId:
The ID of the category whose elements will be included in the schedule, or InvalidElementId for a multi-category schedule.
Returns:
The default view name.
Throws Autodesk.Revit.Exceptions.ArgumentException:
document is not a project document.
-or-
categoryId is not a valid category for a regular schedule.
-or-
The Areas category was specified but an area scheme ID was not provided.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2013

Autodesk.Revit.DB.ViewSchedule.GetValidFamiliesForNoteBlock(Autodesk.Revit.DB.Document)
Gets a list of families that can be used for a note block.
document:
The document.
Returns:
The IDs of all valid families.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2013

Autodesk.Revit.DB.ViewSchedule.GetValidCategoriesForMaterialTakeoff
Gets a list of categories that can be used for a material takeoff.
Returns:
The IDs of all valid categories.
Since:
2013

Autodesk.Revit.DB.ViewSchedule.GetValidCategoriesForKeySchedule
Gets a list of categories that can be used for a key schedule.
Returns:
The IDs of all valid categories.
Since:
2013

Autodesk.Revit.DB.ViewSchedule.GetValidCategoriesForSchedule
Gets a list of categories that can be used for a regular schedule.
Returns:
The IDs of all valid categories.
Since:
2013

Autodesk.Revit.DB.ViewSchedule.IsValidFamilyForNoteBlock(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.ElementId)
Checks whether a family can be used for a note block.
document:
The document.
familyId:
The family ID to check.
Returns:
True if the family can be used for a note block,
false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2013

Autodesk.Revit.DB.ViewSchedule.IsValidCategoryForMaterialTakeoff(Autodesk.Revit.DB.ElementId)
Checks whether a category can be used for a material takeoff.
categoryId:
The category ID to check.
Returns:
True if the category can be used for a material takeoff,
false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2013

Autodesk.Revit.DB.ViewSchedule.IsValidCategoryForKeySchedule(Autodesk.Revit.DB.ElementId)
Checks whether a category can be used for a key schedule.
categoryId:
The category ID to check.
Returns:
True if the category can be used for a key schedule,
false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2013

Autodesk.Revit.DB.ViewSchedule.IsValidCategoryForSchedule(Autodesk.Revit.DB.ElementId)
Checks whether a category can be used for a regular schedule.
categoryId:
The category ID to check.
Returns:
True if the category can be used for a regular schedule,
false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2013

Autodesk.Revit.DB.ViewSchedule.CreateNoteBlock(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.ElementId)
Creates a note block.
Remarks:
A note block is a schedule of the Generic Annotations category
that shows elements of a single family rather than all elements
in the category.
document:
The document to which the new schedule will be added.
familyId:
The ID of the family whose elements will be included in the schedule.
Returns:
The newly created schedule.
Throws Autodesk.Revit.Exceptions.ArgumentException:
document is not a project document.
-or-
familyId is not a valid family for a note block.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.ModificationForbiddenException:
The document is in failure mode: an operation has failed,
and Revit requires the user to either cancel the operation
or fix the problem (usually by deleting certain elements).
-or-
The document is being loaded, or is in the midst of another
sensitive process.
Throws Autodesk.Revit.Exceptions.ModificationOutsideTransactionException:
The document has no open transaction.
Since:
2013

Autodesk.Revit.DB.ViewSchedule.CreateRevisionSchedule(Autodesk.Revit.DB.Document)
Creates a revision schedule.
Remarks:
Revision schedules are added to titleblock families and become
visible as part of titleblocks on sheets.
document:
The titleblock family document to which the new schedule will be added.
Returns:
The newly created schedule.
Throws Autodesk.Revit.Exceptions.ArgumentException:
document is not a titleblock family.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.ModificationForbiddenException:
The document is in failure mode: an operation has failed,
and Revit requires the user to either cancel the operation
or fix the problem (usually by deleting certain elements).
-or-
The document is being loaded, or is in the midst of another
sensitive process.
Throws Autodesk.Revit.Exceptions.ModificationOutsideTransactionException:
The document has no open transaction.
Since:
2013

Autodesk.Revit.DB.ViewSchedule.CreateKeynoteLegend(Autodesk.Revit.DB.Document)
Creates a keynote legend.
Remarks:
A keynote legend is a schedule of the Keynote Tags category.
document:
The document to which the new schedule will be added.
Returns:
The newly created schedule.
Throws Autodesk.Revit.Exceptions.ArgumentException:
document is not a project document.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.ModificationForbiddenException:
The document is in failure mode: an operation has failed,
and Revit requires the user to either cancel the operation
or fix the problem (usually by deleting certain elements).
-or-
The document is being loaded, or is in the midst of another
sensitive process.
Throws Autodesk.Revit.Exceptions.ModificationOutsideTransactionException:
The document has no open transaction.
Since:
2013

Autodesk.Revit.DB.ViewSchedule.CreateSheetList(Autodesk.Revit.DB.Document)
Creates a sheet list.
Remarks:
A sheet list is a schedule of sheets in the project.
It is a schedule of the Sheets category.
document:
The document to which the new schedule will be added.
Returns:
The newly created schedule.
Throws Autodesk.Revit.Exceptions.ArgumentException:
document is not a project document.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.ModificationForbiddenException:
The document is in failure mode: an operation has failed,
and Revit requires the user to either cancel the operation
or fix the problem (usually by deleting certain elements).
-or-
The document is being loaded, or is in the midst of another
sensitive process.
Throws Autodesk.Revit.Exceptions.ModificationOutsideTransactionException:
The document has no open transaction.
Since:
2013

Autodesk.Revit.DB.ViewSchedule.CreateViewList(Autodesk.Revit.DB.Document)
Creates a view list.
Remarks:
A view list is a schedule of views in the project.
It is a schedule of the Views category.
document:
The document to which the new schedule will be added.
Returns:
The newly created schedule.
Throws Autodesk.Revit.Exceptions.ArgumentException:
document is not a project document.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.ModificationForbiddenException:
The document is in failure mode: an operation has failed,
and Revit requires the user to either cancel the operation
or fix the problem (usually by deleting certain elements).
-or-
The document is being loaded, or is in the midst of another
sensitive process.
Throws Autodesk.Revit.Exceptions.ModificationOutsideTransactionException:
The document has no open transaction.
Since:
2013

Autodesk.Revit.DB.ViewSchedule.CreateMaterialTakeoff(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.ElementId)
Creates a material takeoff.
Remarks:
A material takeoff is a schedule that displays information about
the materials that make up elements in the model.  Unlike regular
schedules where each row (before grouping) represents a single
element, each row in a material takeoff represents a single
<element, material> pair.
document:
The document to which the new schedule will be added.
categoryId:
The ID of the category whose elements will be included in the schedule,
or InvalidElementId for a multi-category schedule.
Returns:
The newly created schedule.
Throws Autodesk.Revit.Exceptions.ArgumentException:
document is not a project document.
-or-
categoryId is not a valid category for a material takeoff.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.ModificationForbiddenException:
The document is in failure mode: an operation has failed,
and Revit requires the user to either cancel the operation
or fix the problem (usually by deleting certain elements).
-or-
The document is being loaded, or is in the midst of another
sensitive process.
Throws Autodesk.Revit.Exceptions.ModificationOutsideTransactionException:
The document has no open transaction.
Since:
2013

Autodesk.Revit.DB.ViewSchedule.CreateKeySchedule(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.ElementId)
Create a key schedule.
Remarks:
A key schedule displays abstract "key" elements that can be used to
populate parameters of ordinary model elements.
document:
The document to which the new schedule will be added.
categoryId:
The ID of the category of elements that the schedule's keys will be associated with.
Returns:
The newly created schedule.
Throws Autodesk.Revit.Exceptions.ArgumentException:
document is not a project document.
-or-
categoryId is not a valid category for a key schedule.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.ModificationForbiddenException:
The document is in failure mode: an operation has failed,
and Revit requires the user to either cancel the operation
or fix the problem (usually by deleting certain elements).
-or-
The document is being loaded, or is in the midst of another
sensitive process.
Throws Autodesk.Revit.Exceptions.ModificationOutsideTransactionException:
The document has no open transaction.
Since:
2013

Autodesk.Revit.DB.ViewSchedule.CreateSchedule(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.ElementId,Autodesk.Revit.DB.ElementId)
Creates a regular schedule that can relate to a specific area scheme.
document:
The document to which the new schedule will be added.
categoryId:
The ID of the category whose elements will be included in the schedule, or InvalidElementId for a multi-category schedule.
areaSchemeId:
The ID of an area scheme in an area schedule, InvalidElementId otherwise.
Returns:
The newly created schedule.
Throws Autodesk.Revit.Exceptions.ArgumentException:
document is not a project document.
-or-
categoryId is not a valid category for a regular schedule.
-or-
In a non-area schedule, areaSchemeId is not InvalidElementId.
-or-
In an area schedule, areaSchemeId is not the ID of an area scheme.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.ModificationForbiddenException:
The document is in failure mode: an operation has failed,
and Revit requires the user to either cancel the operation
or fix the problem (usually by deleting certain elements).
-or-
The document is being loaded, or is in the midst of another
sensitive process.
Throws Autodesk.Revit.Exceptions.ModificationOutsideTransactionException:
The document has no open transaction.
Since:
2013

Autodesk.Revit.DB.ViewSchedule.CreateSchedule(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.ElementId)
Creates a regular schedule.
document:
The document to which the new schedule will be added.
categoryId:
The ID of the category whose elements will be included in the schedule, or InvalidElementId for a multi-category schedule.
Returns:
The newly created schedule.
Throws Autodesk.Revit.Exceptions.ArgumentException:
document is not a project document.
-or-
categoryId is not a valid category for a regular schedule.
-or-
The Areas category was specified but an area scheme ID was not provided.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.ModificationForbiddenException:
The document is in failure mode: an operation has failed,
and Revit requires the user to either cancel the operation
or fix the problem (usually by deleting certain elements).
-or-
The document is being loaded, or is in the midst of another
sensitive process.
Throws Autodesk.Revit.Exceptions.ModificationOutsideTransactionException:
The document has no open transaction.
Since:
2013

Autodesk.Revit.DB.ViewSchedule.IsInternalKeynoteSchedule
Identifies if this ViewSchedule is an internal schedule used when keynotes are filtered based on the elements that are shown on a sheet.
Remarks:
These schedules cannot be modified by the user or placed on sheets.
Since:
2013

Autodesk.Revit.DB.ViewSchedule.IsTitleblockRevisionSchedule
Identifies if this ViewSchedule is an internal schedule used to display revision schedules as part of a titleblock.
Remarks:
These schedules cannot be modified by the user or placed on sheets.
Since:
2013

Autodesk.Revit.DB.ViewSchedule.ImageRowHeight
Defines the image row height in the schedule.
Remarks:
If there is at least one image field in the schedule, then setting this property will force all rows containing images to be
resized to the indicated height value (when viewed as a ScheduleSheetInstance on a ViewSheet). Setting this property will have
no effect if HasImageField returns false.
This height will be maintained until the user or application restores the original image sizes (in API: Autodesk.Revit.DB.ViewSchedule.RestoreImageSize).
The row height for any rows containing images in the schedule. The value is 0.0 by default if not customized.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: The given value for imageRowHeight must be greater than 0 and no more than 30000 feet.
Since:
2015

Autodesk.Revit.DB.ViewSchedule.KeyScheduleParameterName
In a key schedule, the name of the parameter for choosing one of the keys.
Remarks:
When a key schedule is created, elements of the schedule's category
receive a new parameter for choosing one of the keys defined in the key schedule.
This is the name of that parameter.
The name of the key schedule parameter.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
This ViewSchedule is not key schedule.
Throws Autodesk.Revit.Exceptions.ModificationForbiddenException:
When setting this property: The document containing this ViewSchedule is in failure mode: an operation has failed,
and Revit requires the user to either cancel the operation
or fix the problem (usually by deleting certain elements).
-or-
When setting this property: The document containing this ViewSchedule is being loaded, or is in the midst of another
sensitive process.
-or-
When setting this property: This ViewSchedule is an internal element, such as a component of a
loaded family or a group type.
-or-
When setting this property: The document containing this ViewSchedule is in Group Edit Mode,
Sketch Edit Mode, or Paste Mode, and the element is not a
member of the group, sketch, or clipboard.
-or-
When setting this property: This ViewSchedule is a member of a group or sketch, and the document
is not currently editing the group or sketch.
Throws Autodesk.Revit.Exceptions.ModificationOutsideTransactionException:
When setting this property: The document containing this ViewSchedule has no open transaction.
Since:
2013

Autodesk.Revit.DB.ViewSchedule.EmbeddedDefinition
The embedded ScheduleDefinition.
Since:
2013

Autodesk.Revit.DB.ViewSchedule.Definition
The primary ScheduleDefinition.
Since:
2013

Autodesk.Revit.DB.ViewSchedule.BodyTextTypeId
Defines the default text style used for the data section of the schedule.
Remarks:
Columns may override the default style.
Throws Autodesk.Revit.Exceptions.ArgumentException:
When setting this property: The text type id doesn't represent a valid text type element.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was NULL
Since:
2014

Autodesk.Revit.DB.ViewSchedule.HeaderTextTypeId
Defines the default text style used in the column headers in the body section of the schedule.
Throws Autodesk.Revit.Exceptions.ArgumentException:
When setting this property: The text type id doesn't represent a valid text type element.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was NULL
Since:
2014

Autodesk.Revit.DB.ViewSchedule.TitleTextTypeId
Defines the default text style used in the header section of the schedule.
Remarks:
Cells may override the default style.
Throws Autodesk.Revit.Exceptions.ArgumentException:
When setting this property: The text type id doesn't represent a valid text type element.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was NULL
Since:
2014

Autodesk.Revit.DB.ViewSchedule
A schedule view.
Remarks:
The ViewSchedule class represents schedules and other schedule-like views,
including single-category and multi-category schedules, key schedules,
material takeoffs, view lists, sheet lists, keynote legends, revision schedules,
and note blocks.  The ViewSchedule class is not used for panel schedules
(see PanelScheduleView) or graphical column schedules.
A schedule is a tabular representation of data.  A typical
schedule shows all elements of a category (doors, rooms, etc.)
with each row representing an element and each column representing a
parameter.  This basic structure can be modified using filters, sorting,
grouping, totals, formulas, and other features.
The ScheduleDefinition class contains most settings that determine
the contents of a schedule, including category, fields, filters, and sorting.
A graphical representation of a schedule can be placed on a sheet
using the ScheduleSheetInstance class.
Since:
2013